//JS 개인 공부용 

/* 자주 사용하는 키워드 정리

[1] 변수 및 상수
let : 변할 수 있는 변수 선언
const : 변하지 않는 상수 선언

[2] 데이터 타입
Number : 숫자
String : 문자열
Boolean : 참/거짓
Array : 배열 
Object : 객체

[3] 함수
function : 함수 선언
()=>{} : 화살표 함수

[4] 조건문 및 반복문
if, else, else if : 조건문
switch : 여러 경우를 처리하는 조건문
for, while, do wile : 반복문

[5] 논리 연산자 및 비교 연산자
=== / !== : 일치/불일치 (자료형까지 비교함)
== / != : 값만 비교 (자료형 자동변환O)
&& : and 
|| : or 
! : not 
> 자동변환으로 버그가 일어날 수 있으니 주의하자자

*/

/*
식별자 (변수명, 함수명)
1. 키워드를 사용하면 안 된다. ex) do, in, if ... 
2. 숫자로 시작하면 안 된다. ex) 1a, 12ab
3. 특수문자는 _과 $만 허용한다.
4. 공백문자를 포함할 수 없다.
*/

/*
이스케이프 문자
\t : 수평탭
\n : 줄바꿈
\' : 작은따옴표
\" : 큰따옴표
\\ : 역슬래시
*/
